NETMF/netmf-interpreter/Solutions/STM32F4DISCOVERY/DeviceCode/Initialization/tinyhal.cpp
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// This file is part of the Microsoft .NET Micro Framework Porting Kit Code Samples and is unsupported. 
// Copyright (c) Microsoft Open Technologies, Inc. All rights reserved.
// 
// Licensed under the Apache License, Version 2.0 (the "License"); you may not use these files except in compliance with the License.
// You may obtain a copy of the License at:
// 
// http://www.apache.org/licenses/LICENSE-2.0
// 
// Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing
// permissions and limitations under the License.
// 
#include <tinyhal.h>
#include "stm32f4xx.h"

#if defined(PLATFORM_ARM_OS_PORT)
#include <cmsis_os.h>
#include <stdint.h>
#endif

// we need this to force inclusion from library at link time
#pragma import(EntryPoint)

#undef  TRACE_ALWAYS
#define TRACE_ALWAYS               0x00000001

#undef  DEBUG_TRACE
#define DEBUG_TRACE (TRACE_ALWAYS)
// these define the region to zero initialize
extern UINT32 Image$$ER_RAM_RW$$ZI$$Base;
extern UINT32 Image$$ER_RAM_RW$$ZI$$Length;

// here is the execution address/length of code to move from FLASH to RAM
#define IMAGE_RAM_RO_BASE   Image$$ER_RAM_RO$$Base
#define IMAGE_RAM_RO_LENGTH Image$$ER_RAM_RO$$Length

extern UINT32 IMAGE_RAM_RO_BASE;
extern UINT32 IMAGE_RAM_RO_LENGTH;

// here is the execution address/length of data to move from FLASH to RAM
extern UINT32 Image$$ER_RAM_RW$$Base;
extern UINT32 Image$$ER_RAM_RW$$Length;

// here is the load address of the RAM code/data
#define LOAD_RAM_RO_BASE Load$$ER_RAM_RO$$Base

extern UINT32 LOAD_RAM_RO_BASE;
extern UINT32 Load$$ER_RAM_RW$$Base;

#if defined(TARGETLOCATION_RAM)

extern UINT32 Load$$ER_RAM$$Base;
extern UINT32 Image$$ER_RAM$$Length;

#elif defined(TARGETLOCATION_FLASH)

extern UINT32 Load$$ER_FLASH$$Base;
extern UINT32 Image$$ER_FLASH$$Length;

#else
    !ERROR
#endif

UINT32 LOAD_IMAGE_Start;
UINT32 LOAD_IMAGE_Length;
UINT32 LOAD_IMAGE_CalcCRC;

#if defined(PLATFORM_ARM_OS_PORT) && defined(TCPIP_LWIP_OS)
extern UINT32 Load$$ER_LWIP_OS$$RW$$Base; 
extern UINT32 Image$$ER_LWIP_OS$$RW$$Base;
extern UINT32 Image$$ER_LWIP_OS$$RW$$Length; 
extern UINT32 Image$$ER_LWIP_OS$$ZI$$Base;
extern UINT32 Image$$ER_LWIP_OS$$ZI$$Length;
#endif

//
//  The ARM linker is not keeping FirstEntry.obj (and EntryPoint) for RTM builds of NativeSample (possibly others)
//  The --keep FirstEntry.obj linker option also does not work, however, this unused method call to EntryPoint does the trick.
//
void KEEP_THE_LINKER_HAPPY_SINCE_KEEP_IS_NOT_WORKING()
{
    EntryPoint();
}

#pragma arm section code = "SectionForBootstrapOperations"

static void __section("SectionForBootstrapOperations") Prepare_Copy( UINT32* src, UINT32* dst, UINT32 len )
{
    if(dst != src)
    {
        INT32 extraLen = len & 0x00000003;
        len            = len & 0xFFFFFFFC;
        
        while(len != 0)
        {
            *dst++ = *src++;

            len -= 4;
        }

        // thumb2 code can be multiples of 2...

        UINT8 *dst8 = (UINT8*) dst, *src8 = (UINT8*) src;

        while (extraLen > 0)
        {
            *dst8++ = *src8++;

            extraLen--;
        }
    }
}

static void __section("SectionForBootstrapOperations") Prepare_Zero( UINT32* dst, UINT32 len )
{
    INT32 extraLen = len & 0x00000003;
    len            = len & 0xFFFFFFFC;

    while(len != 0)
    {
        *dst++ = 0;

        len -= 4;
    }

    // thumb2 code can be multiples of 2...

    UINT8 *dst8 = (UINT8*) dst;

    while (extraLen > 0)
    {
        *dst8++ = 0;

        extraLen--;
    }
}


#if defined(PLATFORM_ARM_OS_PORT) && defined(TCPIP_LWIP_OS)
// Hack: refer to work item #2374
// For reasons unknown, the ARM linker is getting the
// fixup for the LoadRegion symbol incorrect. The data
// is located correctly but the fixed up pointer stored
// in the literal pool that this code loads for the address
// of the load base (src) is off by some factor. In initial
// testing it was always 0x90, unfortunately it turns out
// not to be consistent and bumped up to 0xED0, and is now
// back at 0x90... Sigh... Hope to hear back from ARM support
// on this soon. ARM has confirmed the bug as related to the
// use of a non-compressed region in the scatter file. Since
// the code here doesn't understand the linker compression
// the region is uncompressed, however the linker bug is 
// that an uncompressed region that follows after a compressed
// one will get the invalid Load$$xxx$$Base value. If the
// scatter file is updated to ensure all regions occuring
// before this one are also uncompressed it works ok.
const UINT32 ArmLinkerLoadRegionOffsetHack = 0x00000000;
void LwipRegionInit()
{
    // Copy RAM RW regions into proper location.
    {
        UINT32* src = (UINT32*)&Load$$ER_LWIP_OS$$RW$$Base; 
        UINT32* dst = (UINT32*)&Image$$ER_LWIP_OS$$RW$$Base;
        UINT32  len = (UINT32) &Image$$ER_LWIP_OS$$RW$$Length; 

        // Hack: refer to work item #2374
        //src = reinterpret_cast<UINT32*>(reinterpret_cast<UINT32>(src) - ArmLinkerLoadRegionOffsetHack );

        Prepare_Copy( src, dst, len );
    }

    // Initialize RAM ZI regions.
    {
        UINT32* dst = (UINT32*)&Image$$ER_LWIP_OS$$ZI$$Base;
        UINT32  len = (UINT32) &Image$$ER_LWIP_OS$$ZI$$Length;

        Prepare_Zero( dst, len );
    }
}
#endif

#if !defined(PLATFORM_ARM_OS_PORT) || defined(__GNUC__)
void __section("SectionForBootstrapOperations") PrepareImageRegions()
{
    //
    // Copy RAM RO regions into proper location.
    //
    {
        UINT32* src = (UINT32*)&LOAD_RAM_RO_BASE; 
        UINT32* dst = (UINT32*)&IMAGE_RAM_RO_BASE;
        UINT32  len = (UINT32 )&IMAGE_RAM_RO_LENGTH; 

        Prepare_Copy( src, dst, len );
    }

    //
    // Copy RAM RW regions into proper location.
    //
    {
        UINT32* src = (UINT32*)&Load$$ER_RAM_RW$$Base; 
        UINT32* dst = (UINT32*)&Image$$ER_RAM_RW$$Base;
        UINT32  len =  (UINT32)&Image$$ER_RAM_RW$$Length; 

        Prepare_Copy( src, dst, len );
    }

    //
    // Initialize RAM ZI regions.
    //
    {
        UINT32* dst = (UINT32*)&Image$$ER_RAM_RW$$ZI$$Base;
        UINT32  len = (UINT32 )&Image$$ER_RAM_RW$$ZI$$Length;

        Prepare_Zero( dst, len );
    }
    
    //Copy RAM RW regions into proper location.
    {
        UINT32* src = (UINT32*)&Load$$ER_LWIP_OS$$RW$$Base; 
        UINT32* dst = (UINT32*)&Image$$ER_LWIP_OS$$RW$$Base;
        UINT32  len = (UINT32) &Image$$ER_LWIP_OS$$RW$$Length; 

        // Hack: refer to work item #2374
        //src = reinterpret_cast<UINT32*>(reinterpret_cast<UINT32>(src) - ArmLinkerLoadRegionOffsetHack );

        Prepare_Copy( src, dst, len );
    }

    // Initialize RAM ZI regions.
    {
        UINT32* dst = (UINT32*)&Image$$ER_LWIP_OS$$ZI$$Base;
        UINT32  len = (UINT32) &Image$$ER_LWIP_OS$$ZI$$Length;

        Prepare_Zero( dst, len );
    }
}
#else
extern "C" void PrepareImageRegions()
{
    // This space intentionally left blank... 8^)
    //
    // The OS boot of CLR on CMSIS-RTX doesn't
    // use this as it relies on the C/C++ runtime
    // to handle initialization. However, to keep
    // from adding more libraries or #if checks
    // in code this is defined to allow normal
    // linking with the same HAL libs used in a 
    // boot loader.
}
#endif

