NETMF/netmf-interpreter/Solutions/STM32F4DISCOVERY/DeviceCode/Initialization/tinyhal.cpp
    I2C_Initialize();

    Buttons_Initialize();

    // Initialize the backlight to a default off state
    //BackLight_Initialize();

    //Piezo_Initialize();

    //Battery_Initialize();

    //Charger_Initialize();

    PalEvent_Initialize();
    //Gesture_Initialize();
    //Ink_Initialize();
    TimeService_Initialize();

#if defined(ENABLE_NATIVE_PROFILER)
    Native_Profiler_Init();
#endif
}

void HAL_UnReserveAllGpios()
{
    for(INT32 i = CPU_GPIO_GetPinCount()-1; i >=0; i--)
    {
        CPU_GPIO_ReservePin((GPIO_PIN)i, false);
    }
}

void HAL_Uninitialize()
{
    int i;
    
#if defined(ENABLE_NATIVE_PROFILER)
    Native_Profiler_Stop();
#endif
 
    for(i=0; i<ARRAYSIZE(s_rebootHandlers); i++)
    {
        if(s_rebootHandlers[i] != NULL)
        {
            s_rebootHandlers[i]();
        }
        else
        {
            break;
        }
    }    

    //LCD_Uninitialize();

    I2C_Uninitialize();

    Buttons_Uninitialize();

    // Initialize the backlight to a default off state
    //BackLight_Uninitialize();

    //Piezo_Uninitialize();

    //Battery_Uninitialize();
    //Charger_Uninitialize();

    TimeService_UnInitialize();
    //Ink_Uninitialize();
    //Gesture_Uninitialize();
    PalEvent_Uninitialize();

    SOCKETS_CloseConnections();

#if !defined(HAL_REDUCESIZE)
    CPU_UninitializeCommunication();
#endif

    //FileSystemVolumeList::UninitializeVolumes();

    BlockStorageList::UnInitializeDevices();

    USART_CloseAllPorts();

    CPU_SPI_Uninitialize();

    HAL_UnReserveAllGpios();

    CPU_GPIO_Uninitialize();

    DISABLE_INTERRUPTS();

    Events_Uninitialize();
    Time_Uninitialize();

    HAL_CONTINUATION::Uninitialize();
    HAL_COMPLETION  ::Uninitialize();
    
#if defined(PLATFORM_ARM_OS_PORT) && defined(TCPIP_LWIP_OS)
    LwipRegionInit();
#endif
}

void BootstrapCode_GPIO();

extern "C"
{
#if defined( __GNUC__ )
    extern "C++" int main(void);
    extern void __libc_init_array();
    extern "C" void software_init_hook();

    extern osThreadDef_t os_thread_def_main;

    void __main()
    {
        // Copy writeable data and zero init BSS
        PrepareImageRegions();
        //CPU_GPIO_EnableOutputPin(LED3, TRUE); 

        // Call static constructors
        __libc_init_array();
        //software_init_hook();
        
        if (osKernelInitialize () != osOK)  {          // check osStatus for other possible valid values
            // exit with an error message
            CPU_GPIO_EnableOutputPin(LED6, TRUE);        
        }
        else
        {
            // kernel init OK
            CPU_GPIO_EnableOutputPin(LED6, FALSE);        
        } 
        //CPU_GPIO_EnableOutputPin(LED5, TRUE);       
        //osKernelInitialize();
        //CPU_GPIO_EnableOutputPin(LED6, TRUE); 
        osThreadCreate(&os_thread_def_main, NULL);
        //CPU_GPIO_EnableOutputPin(LED5, TRUE); 
        //osKernelStart();
        CPU_GPIO_EnableOutputPin(LED4, TRUE);        
        //CPU_GPIO_EnableOutputPin(LED4, TRUE); 
        // osKernelStart();    
        // CPU_GPIO_EnableOutputPin(LED5, TRUE); 
       
        //     asm(".syntax unified\n");
        //     asm(".thumb\n");
        //     asm("movs r0,#0\n");
        //     asm("movs r1,#0\n");
        //     asm("mov  r4,r0\n");
        //     asm("mov  r5,r1\n");
        //     asm("ldr  r0,= __libc_fini_array\n");
        //     asm("bl   atexit\n");
        //    asm("bl   __libc_init_array\n");
        //     asm("mov  r0,r4\n");
        //     asm("mov  r1,r5\n");
        //     asm("bl   osKernelInitialize\n");
        //     asm("ldr  r0,=os_thread_def_main\n");
        //     asm("movs r1,#0\n");
        //     asm("bl   osThreadCreate\n");
        //     asm("bl   osKernelStart\n");
        
        // Call the application's entry point.
        main();
    }
#endif

#if !defined(PLATFORM_ARM_OS_PORT)
void BootEntry()
{
#if !defined(BUILD_RTM)
    {
        int  marker;
        int* ptr = &marker - 1; // This will point to the current top of the stack.
        int* end = &StackBottom;

        while(ptr >= end)
        {
            *ptr-- = 0xBAADF00D;
        }
    }
#endif

    // these are needed for patch access

#if defined(TARGETLOCATION_RAM)

    LOAD_IMAGE_Start  = (UINT32)&Load$$ER_RAM$$Base;
    LOAD_IMAGE_Length = (UINT32)&Image$$ER_RAM$$Length;

#elif defined(TARGETLOCATION_FLASH)

    LOAD_IMAGE_Start  = (UINT32)&Load$$ER_FLASH$$Base;
    LOAD_IMAGE_Length = (UINT32)&Image$$ER_FLASH$$Length;

#else
    !ERROR
#endif

    LOAD_IMAGE_Length += (UINT32)&IMAGE_RAM_RO_LENGTH + (UINT32)&Image$$ER_RAM_RW$$Length;

#if !defined(BUILD_RTM)
    g_Boot_RAMConstants_CRC = Checksum_RAMConstants();
#endif


    CPU_Initialize();

    HAL_Time_Initialize();

    HAL_Initialize();

#if !defined(BUILD_RTM) 
    DEBUG_TRACE4( STREAM_LCD, ".NetMF v%d.%d.%d.%d\r\n", VERSION_MAJOR, VERSION_MINOR, VERSION_BUILD, VERSION_REVISION);
    DEBUG_TRACE3(TRACE_ALWAYS, "%s, Build Date:\r\n\t%s %s\r\n", HalName, __DATE__, __TIME__);
#if defined(__GNUC__)
    DEBUG_TRACE1(TRACE_ALWAYS, "GNU Compiler version %d\r\n", __GNUC__);
#else
    DEBUG_TRACE1(TRACE_ALWAYS, "ARM Compiler version %d\r\n", __ARMCC_VERSION);
#endif

    UINT8* BaseAddress;
    UINT32 SizeInBytes;

    HeapLocation( BaseAddress,    SizeInBytes );
    memset      ( BaseAddress, 0, SizeInBytes );

    debug_printf("\f");

    debug_printf("%-15s\r\n", HalName);
    debug_printf("%-15s\r\n", "Build Date:");
    debug_printf("  %-13s\r\n", __DATE__);
    debug_printf("  %-13s\r\n", __TIME__);

#endif  // !defined(BUILD_RTM)

    /***********************************************************************************/

    {
#if defined(FIQ_SAMPLING_PROFILER)
        FIQ_Profiler_Init();
#endif
    }

    // the runtime is by default using a watchdog 
   
