NETMF/netmf-interpreter/Solutions/STM32F4DISCOVERY/DeviceCode/Initialization/tinyhal.cpp
    Watchdog_GetSetTimeout ( WATCHDOG_TIMEOUT , TRUE );
    Watchdog_GetSetBehavior( WATCHDOG_BEHAVIOR, TRUE );
    Watchdog_GetSetEnabled ( WATCHDOG_ENABLE, TRUE );

 
    // HAL initialization completed.  Interrupts are enabled.  Jump to the Application routine
    ApplicationEntryPoint();

    debug_printf("main exited!!???.  Halting CPU\r\n");

#if defined(BUILD_RTM)
    CPU_Reset();
#else
    CPU_Halt();
#endif
}
#endif

} // extern "C"


#if defined(PLATFORM_ARM_OS_PORT)
extern "C" void STM32F4_BootstrapCode();

// performs base level system initialization
// This typically consists of setting up clocks
// and PLLs along with any external memory needed
// to boot. 
// NOTE:
// It is important to keep in mind that this is 
// called *BEFORE* any C/C++ runtime initialization
// That is, zero init of uninitialied writeable data
// and copying of initialized values for initialized 
// writeable data have not yet occured. Thus, any code
// called from SystemInit must not use or rely on 
// initializtion having occured. This also precludes
// the use of any OS provided primitives and support
// as the kernel isn't initialized yet either.
extern "C" void SystemInit()
{
    STM32F4_BootstrapCode();
    // Copy writeable data and zero init BSS
    PrepareImageRegions();
    BootstrapCode_GPIO();
    CPU_Initialize();
    //__enable_irq();
    ENABLE_INTERRUPTS();
}

#endif //PLATFORM_ARM_OS_PORT

//#if !defined(BUILD_RTM)

void debug_printf( const char* format, ... )
{
    char buffer[256] = {0};
    va_list arg_ptr;

    va_start( arg_ptr, format );

   int len = hal_vsnprintf( buffer, sizeof(buffer)-1, format, arg_ptr );

   { // take CLR lock to send whole message
       GLOBAL_LOCK(clrLock);
       // send characters directly to the trace port
       for( char* p = buffer; *p != '\0' || p-buffer >= 256; ++p )
            ITM_SendChar( *p );
   }

    va_end( arg_ptr );
}

void lcd_printf( const char* format, ... )
{
    va_list arg_ptr;

    va_start( arg_ptr, format );

    hal_vfprintf( STREAM_LCD, format, arg_ptr );
}

//#endif  // !defined(BUILD_RTM)

#if !defined(BUILD_RTM)

UINT32 Checksum_RAMConstants()
{
    UINT32* RAMConstants = (UINT32*)&IMAGE_RAM_RO_BASE; 
    UINT32  Length       = (UINT32 )&IMAGE_RAM_RO_LENGTH; 

    UINT32 crc;

    // start with Vector area CRC
    crc = SUPPORT_ComputeCRC(NULL, 0x00000020, 0);

    // add the big block of RAM constants to CRC
    crc = SUPPORT_ComputeCRC(RAMConstants, Length, crc);

    return crc;
}

void Verify_RAMConstants( void* arg )
{
    BOOL BreakpointOnError = (BOOL)arg;

    //debug_printf("RAMC\r\n");

    UINT32 crc = Checksum_RAMConstants();

    if (crc != g_Boot_RAMConstants_CRC)
    {
        hal_printf("RAMC CRC:%08x!=%08x\r\n", crc, g_Boot_RAMConstants_CRC);

        UINT32* ROMConstants  = (UINT32*)&LOAD_RAM_RO_BASE;
        UINT32* RAMConstants  = (UINT32*)&IMAGE_RAM_RO_BASE;
        UINT32  Length        = (UINT32 )&IMAGE_RAM_RO_LENGTH;
        BOOL    FoundMismatch = FALSE;

        for(int i = 0; i < Length; i += 4)
        {
            if(*RAMConstants != *ROMConstants)
            {
                hal_printf( "RAMC %08x:%08x!=%08x\r\n", (UINT32) RAMConstants, *RAMConstants, *ROMConstants );

                if(!FoundMismatch) lcd_printf( "\fRAMC:%08x\r\n", (UINT32)RAMConstants );  // first one only to LCD
                FoundMismatch = TRUE;
            }

            RAMConstants++;
            ROMConstants++;
        }

        if(!FoundMismatch)
        {
            // the vector area must have been trashed
            lcd_printf("\fRAMC:%08x\r\n", (UINT32) NULL);
            RAMConstants = (UINT32*)NULL;

            for(int i = 0; i < 32; i += 4)
            {
                hal_printf( "RAMC %02x:%08x\r\n", i, *RAMConstants   );
                lcd_printf( "%02x:%08x\r\n"     , i, *RAMConstants++ );
            }
        }

        DebuggerPort_Flush( HalSystemConfig.DebugTextPort );

        if(BreakpointOnError)
        {
            HARD_BREAKPOINT();
        }
    }
}

#endif  // !defined(BUILD_RTM)
